Autodesk.Revit.DB.KeyBasedTreeEntryErrorType
An Enum indicating the type of error associated with a KeyBasedTreeEntry.
Since:
2015
Since:
2015

Autodesk.Revit.DB.KeyBasedTreeEntryErrorType.BadClassificationCategoryId
The classification category id is not Revit BuiltInCategory id.

Autodesk.Revit.DB.KeyBasedTreeEntryErrorType.BadClassificationLevel
The classification level is not an integer in range between 1 and 5 inclusive.

Autodesk.Revit.DB.KeyBasedTreeEntryErrorType.InvalidClassificationCode
The classification code does not match the level and parent code.

Autodesk.Revit.DB.KeyBasedTreeEntryErrorType.CircularParentage
A sub-node has been specified as a parent of one of its ancestors.

Autodesk.Revit.DB.KeyBasedTreeEntryErrorType.MissingParent
The parent specified for a entry does not exist in the KeyBasedTreeEntires object.

Autodesk.Revit.DB.KeyBasedTreeEntryErrorType.DuplicateEntry
The same entry appears more than once in the KeyBasedTreeEntries object.